Repository: SteveGilham/altcover
Catalog: AltCover/Strings.*.resx
Languages: eo

# i|inputDirectory=
source: Optional: The folder containing assemblies to instrument (default: current directory)
eo: Laŭvola: La dosierujo enhavanta asembleojn al instrumento (defaŭlta: aktuala dosierujo)

# o|outputDirectory=
source: Optional: The folder to receive the instrumented assemblies and their companions (default: sub-folder '__Instrumented' of the current directory)
eo: Laŭvola: La dosierujo ricevi la instrumentajn asembleojn kaj iliajn kunulojn (defaŭlte: sub-dosierujo '__Instrumented' de la aktuala dosierujo)

# k|key=
source: Optional, multiple: any other strong-name key to use
eo: Laŭvola, multobla: iu ajn alia forta-nomo ŝlosilo por uzi

# sn|strongNameKey=
source: Optional: The default strong naming key to apply to instrumented assemblies (default: None)
eo: Laŭvola: la defaŭlta forta-nomo ŝlosilo por apliki al asembleaj instrumentoj (defaŭlte: Neniu)

# x|xmlReport=
source: Optional: The output report template file (default: coverage.xml in the current directory)
eo: Laŭvola: La eliga raporta ŝablono-dosiero (defaŭlte: 'coverage.xml' en la aktuala dosierujo)

# f|fileFilter=
source: Optional: source file name to exclude from instrumentation (may repeat)
eo: Laŭvola: fonta dosiernomo por ekskludi de instrumentado (eble ripeti)

# s|assemblyFilter=
source: Optional: assembly name to exclude from instrumentation (may repeat)
eo: Laŭvola: ensambla nomo por ekskludi de instrumentado (eble ripeti)

# t|typeFilter=
source: Optional: type name to exclude from instrumentation (may repeat)
eo: Laŭvola: tajpu nomon por ekskludi de instrumentado (eble ripeti)

# m|methodFilter=
source: Optional: method name to exclude from instrumentation (may repeat)
eo: Laŭvola: metodo nomo por ekskludi de instrumentado (eble ripeti)

# a|attributeFilter=
source: Optional: attribute name to exclude from instrumentation (may repeat)
eo: Laŭvola: atribuka nomo por ekskludi de instrumentado (eble ripeti)

# ?|help|h
source: Prints out the options.
eo: Elmetas ĉi tiujn eblojn.

# CreateFolder
source: Creating folder {0}
eo: Krei dosierujon {0}

# HelpText
source: AltCover [/i[nputDirectory]=VALUE] [/o[utputDirectory]=VALUE] [/sn|strongNameKey=VALUE] [/x[mlReport]=VALUE] [/f[ileFilter]=VALUE] [/s|assemblyFilter=VALUE] [/t|typeFilter=VALUE] [/m|methodFilter=VALUE] [/a|attributeFilter=VALUE] [/?|h[elp]] [-- ] [...] or AltCover Runner [/r[ecordingDirectory]=VALUE] [/w[orkingDirectory]=VALUE] [/x||executable=VALUE] [/?|h[elp]] [-- ] [...]
eo: AltCover [/i[nputDirectory]=VALO] [/o[utputDirectory]=VALO] [/y|symbolDirectory=VALO] [/sn|strongNameKey=VALO] [/k[ey]=VALO] [/x[mlReport]=VALO] [/f[ileFilter]=VALO] [/s|assemblyFilter=VALO] [/t|typeFilter=VALO] [/m|methodFilter=VALO] [/a|attributeFilter=VALO] [/?|h[elp]] [-- ] [...] aŭ AltCover Runner [/r[ecordingDirectory]=VALO] [/w[orkingDirectory]=VALO] [/x||executable=VALO] [/?|h[elp]] [-- ] [...]

# NotInPlace
source: From and to directories are identical
eo: De kaj al adresaroj estas identaj

# UsageError
source: Error - usage is:
eo: Eraro - uzado estas:

# instrumentingfrom
source: Instrumenting files from {0}
eo: Instrumentaj dosieroj de {0}

# instrumentingto
source: Writing files to {0}
eo: Skribi dosierojn al {0}

# reportingto
source: Coverage Report: {0}
eo: Kovra Raporto: {0}

# e|assemblyExcludeFilter=
source: Optional: assembly which links other instrumented assemblies but for which internal details may be excluded (may repeat)
eo: Laŭvola: asembleo, kiu kunligas aliajn agordajn asembleojn, sed por kiuj internaĵoj povas esti ekskluditaj (eble ripeti)

# r|recorderDirectory=
source: The folder containing the instrumented code to monitor (including the AltCover.Recorder.g.dll generated by previous a use of the .net core AltCover).
eo: La dosierujo enhavanta la instrumentan kodon por kontroli (inkluzive de la AltCover.Recorder.g.dll generita per antaŭa uzo de la ".net core" AltCover).

# x|executable=
source: The executable to run e.g. dotnet
eo: La ekzekutebla kuri, ekzemple. dotnet

# w|workingDirectory=
source: Optional: The working directory for the application launch
eo: Laŭvola: La laboranta dosierujo por la lanĉo de aplikaĵoj

# %d visits recorded
source: {0} visits recorded
eo: {0} vizitoj registritaj

source: Beginning run...
eo: Komencanta kuri ...

source: Coverage statistics flushing took {0:N} seconds
eo: Kovraj statistika skribado prenis {0:N} sekundojn

source: Getting results...
eo: Akiri rezultojn ...
