Repository: SteveGilham/altcover
Catalog: AltCover.Engine/Strings.*.resx
Languages: eo

# i|inputDirectory=
source: Optional, multiple: A folder containing assemblies to instrument (default: current directory)
eo: Laŭvola, multobla: Dosierujo enhavanta asembleojn al instrumento (defaŭlta: aktuala dosierujo)

# o|outputDirectory=
source: Optional, multiple: A folder to receive the instrumented assemblies and their companions (default: sub-folder '__Instrumented' of the current directory; or '__Saved' if '--inplace' is set). See also '--inplace'
eo: Laŭvola, multobla: Dosierujo ricevi la instrumentajn asembleojn kaj iliajn kunulojn (defaŭlte: sub-dosierujo '__Instrumented' de la aktuala dosierujo; aŭ '__Saved' se '--inplace' estas aro). Vidu ankaŭ '--inplace'

# k|key=
source: Optional, multiple: any other strong-name key to use
eo: Laŭvola, multobla: iu ajn alia forta-nomo ŝlosilo por uzi

# sn|strongNameKey=
source: Optional: The default strong naming key to apply to instrumented assemblies (default: None)
eo: Laŭvola: la defaŭlta forta-nomo ŝlosilo por apliki al asembleaj instrumentoj (defaŭlte: Neniu)

# x|xmlReport=
source: Optional: The output report template file (default: coverage.xml in the current directory)
eo: Laŭvola: La eliga raporta ŝablono-dosiero (defaŭlte: 'coverage.xml' en la aktuala dosierujo)

# f|fileFilter=
source: Optional, multiple: source file name to exclude from instrumentation
eo: Laŭvola, multobla: fonta dosiernomo por ekskludi de instrumentado

# s|assemblyFilter=
source: Optional, multiple: assembly name to exclude from instrumentation
eo: Laŭvola, multobla: ensambla nomo por ekskludi de instrumentado

# t|typeFilter=
source: Optional, multiple: type name to exclude from instrumentation
eo: Laŭvola, multobla: tajpu nomon por ekskludi de instrumentado

# m|methodFilter=
source: Optional, multiple: method name to exclude from instrumentation
eo: Laŭvola, multobla: metodo nomo por ekskludi de instrumentado

# a|attributeFilter=
source: Optional, multiple: attribute name to exclude from instrumentation
eo: Laŭvola, multobla: atribuka nomo por ekskludi de instrumentado

# ?|help|h
source: Prints out the options.
eo: Elmetas ĉi tiujn eblojn.

# CreateFolder
source: Creating folder {0}
eo: Krei dosierujon {0}

# HelpText
source: AltCover [/i[nputDirectory]=VALUE] [/o[utputDirectory]=VALUE] [/y|symbolDirectory=VALUE] [/d[ependency]=VALUE] [/k[ey]=VALUE] [/sn|strongNameKey=VALUE] [/x[mlReport]=VALUE] [/f[ileFilter]=VALUE] [/p[athFilter]=VALUE] [/s|assemblyFilter=VALUE] [/e|assemblyExcludeFilter=VALUE] [/t[ypeFilter]=VALUE] [/m[ethodFilter]=VALUE] [/a[ttributeFilter]=VALUE] [/attributetoplevel=VALUE] [/typetoplevel=VALUE] [/methodtoplevel=VALUE] [--l[ocalSource]] [/c[allContext]=VALUE] [/reportFormat=VALUE] [--inplace] [--save] [--zipfile] [--methodpoint] [--single] [--linecover] [--branchcover] [--dropReturnCode] [--sourcelink] [--defer] [--v[isibleBranches]] [/showstatic[=VALUE]] [--showGenerated] [--?|help|h] [-- ] [...] or AltCover Runner [/r[ecorderDirectory]=VALUE] [/w[orkingDirectory]=VALUE] [/x|executable=VALUE] [--collect] [/l[covReport]=VALUE] [/t[hreshold]=VALUE] [/c[obertura]=VALUE] [/o[utputFile]=VALUE] [--dropReturnCode] [/teamcity[=VALUE]] [--?|help|h] [-- ] [...] or AltCover ImportModule or AltCover Version or, for the global tool only AltCover TargetsPath See https://stevegilham.github.io/altcover/Usage for full details.
eo: AltCover [/i[nputDirectory]=VALO] [/o[utputDirectory]=VALO] [/y|symbolDirectory=VALO] [/d[ependency]=VALO] [/k[ey]=VALO] [/sn|strongNameKey=VALO] [/x[mlReport]=VALO] [/f[ileFilter]=VALO] [/p[athFilter]=VALO] [/s|assemblyFilter=VALO] [/e|assemblyExcludeFilter=VALO] [/t[ypeFilter]=VALO] [/m[ethodFilter]=VALO] [/a[ttributeFilter]=VALO] [/attributetoplevel=VALO] [/typetoplevel=VALO] [/methodtoplevel=VALO] [--l[ocalSource]] [/c[allContext]=VALO] [/reportFormat=VALO] [--inplace] [--save] [--zipfile] [--methodpoint] [--single] [--linecover] [--branchcover] [--dropReturnCode] [--sourcelink] [--defer] [--v[isibleBranches]] [/showstatic[=VALO]] [--showGenerated] [--?|help|h] [-- ] [...] aŭ AltCover Runner [/r[ecorderDirectory]=VALO] [/w[orkingDirectory]=VALO] [/x|executable=VALO] [--collect] [/l[covReport]=VALO] [/t[hreshold]=VALO] [/c[obertura]=VALO] [/o[utputFile]=VALO] [--dropReturnCode] [/teamcity[=VALO]] [--?|help|h] [-- ] [...] aŭ AltCover ImportModule aŭ AltCover Version aŭ, nur por la tutmonda ilo AltCover TargetsPath Vidu https://stevegilham.github.io/altcover/Usage por plenaj detaloj.

# NotInPlace
source: From and to directories {0} are identical
eo: De kaj al adresaroj {0} estas identaj

# UsageError
source: Error - usage is:
eo: Eraro - uzado estas:

# instrumentingfrom
source: Instrumenting files from {0}
eo: Instrumentaj dosieroj de {0}

# instrumentingto
source: Writing files to {0}
eo: Skribi dosierojn al {0}

# reportingto
source: Coverage Report: {0}
eo: Kovra Raporto: {0}

# e|assemblyExcludeFilter=
source: Optional, multiple: assembly which links other instrumented assemblies but for which internal details may be excluded
eo: Laŭvola, multobla: asembleo, kiu kunligas aliajn agordajn asembleojn, sed por kiuj internaĵoj povas esti ekskluditaj

# r|recorderDirectory=
source: The folder containing the instrumented code to monitor (including the AltCover.Recorder.g.dll generated by previous a use of the .net core AltCover).
eo: La dosierujo enhavanta la instrumentan kodon por kontroli (inkluzive de la AltCover.Recorder.g.dll generita per antaŭa uzo de la ".net core" AltCover).

# x|executable=
source: The executable to run e.g. dotnet
eo: La ekzekutebla kuri, ekzemple. dotnet

# w|workingDirectory=
source: Optional: The working directory for the application launch
eo: Laŭvola: La laboranta dosierujo por la lanĉo de aplikaĵoj

# %d visits recorded
source: A total of {0:#,#0} visits recorded
eo: Totalo de {0:#,#0} vizitoj registritaj

source: Beginning run...
eo: Komencanta kuri ...

source: Coverage statistics flushing took {0:N} seconds
eo: Kovraj statistika skribado prenis {0:N} sekundojn

source: Getting results...
eo: Akiri rezultojn ...

# orbinder
source: or
eo: aŭ

# ImportModule
source: ImportModule Prints out the PowerShell script to import the associated PowerShell module
eo: ImportModule Elprenas la PowerShell-skripton por importi la asociita PowerShell-modulo

# reportFormat=
source: Optional: Generate the report in the specified format (NCover or the default OpenCover)
eo: Laŭvola: Generu la raporton en la specifita formato (NCover aŭ la defaŭlta OpenCover)

# CommandLine
source: Command line : '{0} {1}'
eo: Komandlinio: '{0} {1}'

# y|symbolDirectory=
source: Optional, multiple: Additional directory to search for matching symbols for the assemblies in the input directory
eo: Laŭvola, multobla: Aldona dosierujo serĉi kongruajn simbolojn por la asembleoj en la eniga dosierujo

# c|callContext=
source: Optional, multiple: Tracking either times of visits in ticks or designated method calls leading to the visits. A single digit 0-7 gives the number of decimal places of seconds to report; everything else is at the mercy of the system clock information available through DateTime.UtcNow A string in brackets "[]" is interpreted as an attribute type name (the trailing "Attribute" is optional), so [Test] or [TestAttribute] will match; if the name contains one or more ".", then it will be matched against the full name of the attribute type. Other strings are interpreted as method names (fully qualified if the string contains any "." characters). Incompatible with --single
eo: Laŭvola, multobla: Rilatado aŭ tempoj de vizitoj en tikoj aŭ nomitaj metodvokoj kondukantaj al la vizitoj. Ununura cifero 0-7 donas la nombron de dekuma lokoj de sekundoj por raporti; ĉio alia kompatas la sistemon horloĝon disponebla per DateTime.UtcNow Kordo en krampoj [] estas interpretita kiel atributo tipo nomon (la malantaŭa parto "Attribute" estas nedeviga), do [Test] aŭ [TestAttribute] kongruas; se la nomo enhavas unu aŭ pli ".", tiam ĝi estos egalita kontraŭ la plena nomo de la atributa tipo. Aliaj kordoj estas interpretitaj kiel metodnomoj (plene kvalifikitaj se la ĉeno enhavas ajnajn "" "karakterojn). Nekongrua kun --single

# DirectoryNotFound
source: {0} : Directory {1} not found
eo: {0} : Dosierujo {1} ne trovita

# FileNotFound
source: {0} : File {1} not found
eo: {0} : Dosiero {1} ne trovita

# InvalidValue
source: {0} : cannot be '{1}'
eo: {0} : ne povas esti '{1}'

# MultiplesNotAllowed
source: {0} : specify this only once
eo: {0} : specifu ĉi tion nur unufoje

# collect
source: Optional: Process previously saved raw coverage data, rather than launching a process.
eo: Laŭvola: Procezo antaŭe konservis krudajn kovraĵojn, anstataŭ ĵeti procezon.

# inplace
source: Optional: Instrument the inputDirectory, rather than the outputDirectory (e.g. for dotnet test)
eo: Laŭvola: Instrumento de inputDirectory, prefere ol outputDirectory (ekz. por dotnet test)

# save
source: Optional: Write raw coverage data to file for later processing
eo: Laŭvola: Skribu krudan kovradan datumon al dosiero por posta prilaborado

# instrumentingin
source: Instrumenting files in {0}
eo: Instrumentaj dosieroj en {0}

# savingto
source: Saving files to {0}
eo: Ŝpari dosierojn al {0}

# executableRequired
source: Use in 'runner' mode requires exactly one of either '--executable' or '--collect'.
eo: Uzo en la "runner" postulas precize unu el ĉu '--executable' aŭ '--collect'.

# recorderNotFound
source: Recorder assembly {0} not found in the nominated directory.
eo: Agordo de registradoj {0} ne trovita en la nomumita dosierujo.

# recorderRequired
source: The '--recorderDirectory' value is required.
eo: La valoro '--recorderDirectory' estas postulita.

# SaveExists
source: Output directory for saved files {0} already exists
eo: Elŝuta dosierujo por konservitaj dosieroj {0} jam ekzistas

# l|lcovReport=
source: Optional: File for lcov format version of the collected data
eo: Laŭvola: Dosiero por la versio de formato lcov de la datumoj kolektitaj

# Alternative
source: ==== Alternative Results (includes all methods including those without corresponding source) ====
eo: ==== Alternativaj Rezultoj (inkluzivas ĉiujn metodojn inkluzive de tiuj sen responda fonto) ====

# AltVC
source: Alternative Visited Classes {0} of {1} ({2})
eo: Alternativaj Vizititaj Klasoj {0} de {1} ({2})

# AltVM
source: Alternative Visited Methods {0} of {1} ({2})
eo: Alternativaj Vizititaj Metodoj {0} de {1} ({2})

# VisitedBranches
source: Visited Branches {0} of {1} ({2})
eo: Vizititaj Branĉoj {0} de {1} ({2})

# VisitedClasses
source: Visited Classes {0} of {1} ({2})
eo: Vizititaj Klasoj {0} de {1} ({2})

# VisitedMethods
source: Visited Methods {0} of {1} ({2})
eo: Vizititaj Metodoj {0} de {1} ({2})

# VisitedPoints
source: Visited Points {0} of {1} ({2})
eo: Vizititaj Punktoj {0} de {1} ({2})

# Collection
source: ERROR *** Collection phase failed
eo: ERROR *** Kolekto fazo malsukcesis

# Instrumentation
source: ERROR *** Instrumentation phase failed
eo: ERROR *** Instrumentation fazo malsukcesis

# WrittenTo
source: Details written to {0}
eo: Detaloj skribitaj al {0}

# WrittenToEx
source: Details written to {0} If this problem was detected in the pre-test instrumentation stage of `dotnet test`, then the file may have been moved to {1} when the task completes.
eo: Detaloj skribitaj al {0} Se ĉi tiu problemo estis detektita en la antaŭprova instrumenta stadio de `dotnet test`, tiam la dosiero eble estis movita al {1} kiam la tasko kompletigas.

# t|threshold=
source: Optional: one or more of minimum acceptable statement (S), branch (B) or method (M/AM) coverage percentage (integer, 1 to 100) or maximum acceptable CRAP score (C/AC followed by integer, 1 to 255) e.g. M80C40B50. If the value starts with a number, a leading S is assumed. If any threshold is specified more than once, the last instance is assumed -- so 25S50 counts as S50. Zero/absent values are ignored. If a coverage result is below threshold, or the CRAP score is above threshold, the return code of the process is the largest abs(threshold - actual) rounded up to the nearest integer. AM, AC include methods with no source; the default is to ignore such methods.
eo: Laŭvola: unu aŭ pluraj el minimuma akceptebla deklaro (S), branĉo (B) aŭ metodo (M/AM) kovranta procento (entjero, 1 ĝis 100) aŭ maksimume akceptebla CRAP-poentaro (C/AC sekvita per entjero, 1 ĝis 255) t.e. M80C40B50. Se la valoro komenciĝas per nombro, majstro S supozas. Se iu sojlo estas specifita pli ol unu fojon, la lasta petskribo supozas - do 25S50 estas interpretita kiel S50. Nuloj / forestantaj valoroj estas ignorataj. Se priraportada rezulto estas sub sojlo, aŭ la CRAP-poentaro estas super la sojlo, la revena kodo de la procezo estas la plej granda abs (sojlo - reala) rondeta ĝis la plej proksima entjero. AM, AC inkluzivas metodojn kun neniu fonto; la defaŭlto estas ignori tiajn metodojn.

# c|cobertura=
source: Optional: File for Cobertura format version of the collected data
eo: Laŭvola: Dosiero por la versio de formato Cobertura de la datumoj kolektitaj

# Statements
source: Statement coverage percentage achieved is {0}% below the threshold of {1}%.
eo: La procenta raporto atingita estas {0}% sub la sojlo de {1}%.

# o|outputFile=
source: Optional: write the recorded coverage to this file rather than overwriting the original report file.
eo: Laŭvola: skribu la registradan kovradon al ĉi tiu dosiero anstataŭ anstataŭi la originalan raportan dosieron.

# resolved
source: Resolved assembly reference '{0}' as file '{1}'.
eo: Rezolita asemblea referenco '{0}' kiel dosiero '{1}'.

# d|dependency=
source: Optional, multiple: assembly path to resolve missing reference.
eo: Laŭvola, multobla: asemblea vojo por solvi mankas referenco.

# NotAnAssembly
source: {0} : File {1} is not an assembly
eo: {0}: Dosiero {1} ne estas asemblea

# %d visits recorded in %A (%A visits/sec)
source: {0:#,#0} visits recorded in {1} ({2:#,#0} visits/sec)
eo: {0:#,#0} vizitoj registritaj en {1} ({2:#,#0} visits/sek)

# Version
source: Version Prints out the AltCover build version
eo: Version Printas la AltCover-konstruan version

# Incompatible
source: Command line options {0} and {1} are mutally exclusive.
eo: Komandlinioj opcioj {0} kaj {1} estas reciproke ekskluzivaj.

# single
source: Optional: only record the first hit at any location. Incompatible with --callContext.
eo: Laŭvola: nur registru la unuan sukceson en ajna loko. Nekongrua kun --callContext.

# linecover
source: Optional: Do not record branch coverage. Implies, and is compatible with, the --reportFormat=opencover option. Incompatible with --branchcover.
eo: Laŭvola: Ne registru branĉan kovradon. Implikas, kaj estas kongrua kun, la --reportFormat=opencover opcio. Nekongrua kun --branchcover.

# branchcover
source: Optional: Do not record line coverage. Implies, and is compatible with, the --reportFormat=opencover option. Incompatible with --linecover.
eo: Ne registru linion-kovradon. Implikas, kaj estas kongrua kun, la --reportFormat=opencover opcio. Nekongrua kun --linecover.

# p|pathFilter=
source: Optional, multiple: source file path to exclude from instrumentation
eo: Laŭvola, multobla: fonta dosiero vojo por ekskludi de instrumentado

# dropReturnCode
source: Optional: Do not report any non-zero return code from a launched process.
eo: Laŭvola: Ne raportu ajnan ne-nula revenan kodon de lanĉita procezo.

# sourcelink
source: Optional: Display sourcelink URLs rather than file paths if present.
eo: Laŭvola: Montru sourcelink-URLojn prefere ol dosieraj vojoj se ĉeestas.

# teamcity:
source: Optional: Show summary in TeamCity format as well as/instead of the OpenCover summary. No value, or the value 'B' means TeamCity Block format, 'R' is b​Ranch format; add a '+' to include the OpenCover style summary as well.
eo: Laŭvola: Montri resumon en la formato TeamCity anstataŭ/same kiel la resumo de OpenCover. Defaŭlta valoro 'B' signifas TeamCity Block-formato, 'R' estas b​Ranch-formato; aldonu '+' por inkluzivi ankaŭ la resuman stilon de OpenCover.

# defer
source: Optional, defers writing runner-mode coverage data until process exit.
eo: Laŭvola, transdono de skriba kurant-reĝimaj priraportado ĝis elira procezo.

# DuplicatesNotAllowed
source: {0} was already specified for {1}
eo: {0} estis jam specifita por {1}

# l|localSource
source: Don't instrument code for which the source file is not present.
eo: Ne instrumentu kodon por kiu la fontdosiero ne ĉeestas.

# v|visibleBranches
source: Hide complex internal IL branching implementation details in switch/match constructs, and just show what the source level logic implies.
eo: Kaŝu kompleksajn internajn IL-branĉajn efektivigajn detalojn en ŝaltilo / matĉaj konstruaĵoj, kaj nur montru, kion implicas la fontnivela logiko.

# showstatic:
source: Optional: Instrument and show code that is by default skipped as trivial. --showstatic:- is equivalent to omitting the parameter; --showstatic or --showstatic:+ sets the unvisited count to a negative value interpreted by the visualizer (but treated as zero by ReportGenerator) ; --showstatic:++ sets the unvisited count to zero.
eo: Laŭvola: Instrumenta kaj spektakla kodo defaŭlte saltis kiel bagatela. --showstatic:- egalas al preterlasado de la parametro; --spektakla au --showstatic:+ fiksas la nevideblan kalkulon al negativa valoro interpretita de la vidigilo (sed traktata kiel nulo de ReportGenerator); --showstatic: ++ agordas la nevideblan nombron al nulo.

# showGenerated
source: Mark generated code with a visit count of -2 (Automatic) for the Visualizer if unvisited
eo: Marko generis kodon kun defaŭlta vizitkalkulo de -2 (Aŭtomata) por la Vidigilo

# zipfile
source: Optional: Emit the XML report inside a zip archive.
eo: Laŭvola: Resendu la XML-raporton ene de zip-arkivo.

# methodpoint
source: Optional: record only whether a method has been visited or not. Overrides the --linecover and --branchcover options.
eo: Laŭvola: registru nur ĉu metodo estis vizitita aŭ ne. Nuligas la --linecover kaj --branchcover elektojn.

# Branches
source: Branch coverage percentage achieved is {0}% below the threshold of {1}%.
eo: Branĉa kovrada procento atingita estas {0}% sub la sojlo de {1}%.

# Crap
source: Maximum CRAP score achieved is {0} above the threshold of {1}.
eo: Maksimuma CRAP-poentaro atingita estas {0} super la sojlo de {1}.

# Methods
source: Method coverage percentage achieved is {0}% below the threshold of {1}%.
eo: Metoda priraportado atingita estas {0}% sub la sojlo de {1}%.

# AltCrap
source: Alternative maximum CRAP score achieved is {0} above the threshold of {1}.
eo: Alternativa maksimuma CRAP-poentaro atingita estas {0} super la sojlo de {1}.

# AltMethods
source: Alternative method coverage percentage achieved is {0}% below the threshold of {1}%.
eo: Alternativa metoda priraportado atingita estas {0}% sub la sojlo de {1}%.

# attributetoplevel=
source: Optional, multiple: Types marked with an attribute of a type that matches the regex are considered top-level, and are not excluded from coverage on the basis of any type which textually encloses them.
eo: Laŭvola, multoblaj: Tipoj markitaj kun atributo de tipo kiu kongruas kun la regekso estas konsiderataj supraj niveloj kaj ne estas ekskluditaj de priraportado surbaze de iu tipo, kiu tekste fermas ilin.

# methodtoplevel=
source: Optional, multiple: Methods with a name that matches the regex are considered top-level, and are not excluded from coverage on the basis of any method which textually encloses them.
eo: Laŭvola, multoblaj: Metodoj kun nomo kiu kongruas kun la regekso estas konsiderataj supraj niveloj kaj ne estas ekskluditaj de priraportado surbaze de ia metodo tekste ĉirkaŭmetanta ilin.

# typetoplevel=
source: Optional, multiple: Types with a name that matches the regex are considered top-level, and are not excluded from coverage on the basis of any type which textually encloses them.
eo: Laŭvola, multoblaj: Specoj kun nomo kiu kongruas kun la regekso estas konsiderataj supraj niveloj kaj ne estas ekskluditaj de priraportado surbaze de ia ajn tipo, kiu tekste fermas ilin.

# orglobal
source: or, for the global tool only
eo: aŭ, nur por la tutmonda ilo

# TargetsPath
source: TargetsPath Prints out the path to the 'altcover.global.targets' file (as the tool cannot be 'dotnet add'ed to the project). The 'altcover.global.props' file is present in the same directory
eo: TargetsPath Presas la vojon al la dosiero 'altcover.global.targets' (ĉar la ilo ne povas esti inkluzivita en la projekto per 'dotnet add'). La dosiero 'altcover.global.props' estas en la sama dosierujo

# altMaxCrap
source: Alternative maximum CRAP score {0}
eo: Alternativa maksimuma CRAP poentaro {0}

# maxCrap
source: Maximum CRAP score {0}
eo: Maksimuma CRAP poentaro {0}
