Repository: SteveGilham/altcover
Catalog: AltCover.UICommon/Resource.*.resx
Languages: eo

# aboutVisualizer.Comments
source: Coverage visualizer for NCover and OpenCover reports
eo: Kovrilo-visualizilo por raportoj de NCover kaj OpenCover

# aboutVisualizer.Copyright
source: {0} Icons from the Visual Studio 2017 collection https://docs.microsoft.com/en-us/visualstudio/designers/the-visual-studio-image-library
eo: {0} Ikonoj de la Visual Studio 2017-kolekto https://docs.microsoft.com/en-us/visualstudio/designers/the-visual-studio-image-library

# aboutVisualizer.Title
source: About AltCover Visualizer
eo: Pri AltCover Visualizer

# aboutVisualizer.WebsiteLabel
source: Visit the AltCover GitHub repo
eo: Vizitu la magazinon AltCover en GitHub

source: C_redits
eo: _Kreditoj

# fontButton.Label
source: f|_Font...
eo: t|_Tiparo...

# gtk-close
source: _Close
eo: f|_Fermi

# openButton.Label
source: o|_Open...
eo: m|_Malferma ...

# refreshButton.Label
source: r|_Refresh
eo: r|_Refreŝigi

# showAboutButton.Label
source: a|_About...
eo: p|_Pri...

# InvalidFile
source: The file {0} is not a valid coverage file: {1}
eo: La dosiero {0} ne estas valida kovra dosiero: {1}

# SelectFont
source: Select font for source display
eo: Elektu tiparon por fonta ekrano

# SelectXml
source: xml files (*.xml)%xml|json files (*.json)%json|All files (*.*)%*
eo: XML-dosieroj (*.xml)%xml|JSON-dosieroj (*.json)%json|Ĉiuj dosieroj (*.*)%*

# branchesVisited
source: {0} of {1} branches visited
eo: {0} de {1} branĉoj vizititaj

# exitButton.Label
source: x|E_xit
eo: _Eliro

# No source location
source: Method {0} has no corresponding source location
eo: Metodo {0} havas neniun respondan fontan lokon

# g|geometry
source: Clear geometry
eo: Klara geometrio

# r|recentFiles
source: Clear recent file list
eo: Klara lastatempa listo

# OpenFile
source: Select coverage file
eo: Elektu kovra dosiero

# OpenFile.Open
source: _Open
eo: _Malferma

# OpenFile.Cancel
source: _Cancel
eo: _Nuligi

# AboutDialog.License
source: License
eo: Permesilo

# AboutDialog.About
source: About
eo: Pri

source: Close
eo: Fermi

source: Open Coverage File
eo: Malferma Kovrilo Dosiero

# LoadError
source: Coverage File Load Failed
eo: Kovrilo Dosiero Ŝarĝo Malsukcesis

# LoadWarning
source: Inconsistent Coverage File
eo: Nekonforma Kovrilo Dosiero

# LoadInfo
source: Note
eo: Noto

# FileNotFound
source: File not found : {0}
eo: Dosiero ne trovita: {0}
